tap "containeroo/tap"
tap "felixkratz/formulae"
tap "fluxcd/tap"
tap "go-task/tap"
tap "goreleaser/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "loft-sh/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Load/unload environment variables based on $PWD
brew "direnv"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Mac App Store command-line interface
brew "mas"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# SDK for building Kubernetes applications
brew "operator-sdk"
# Fast, disk space efficient package manager
brew "pnpm"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Password generator
brew "pwgen"
# Python version management
brew "pyenv"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Disaster recovery for Kubernetes resources and persistent volumes
brew "velero"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple CLI tool to fetch GitLab CI variables and output them as exportable environment variables.
brew "containeroo/tap/ci-thief"
# Simple CLI tool to generate OTP tokens
brew "containeroo/tap/otpgen"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Flux CLI
brew "fluxcd/tap/flux"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Deliver Go binaries as fast and easily as possible
brew "goreleaser/tap/goreleaser"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Creates fully functional virtual k8s cluster inside host k8s cluster's namespace
brew "loft-sh/tap/vcluster"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Menu bar tool to limit maximum charging percentage
cask "aldente"
# Application launcher and productivity software
cask "alfred"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Voice and text chat software
cask "discord"
# Drivers for DisplayLink docks, adapters and monitors
cask "displaylink"
# App to build and share containerised applications and microservices
cask "docker"
# Web browser
cask "firefox"
# Typeface made for developers
cask "font-jetbrains-mono"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# App to write, plan, collaborate, and get organised
cask "notion"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Virtual machines UI using QEMU
cask "utm"
# Multimedia player
cask "vlc"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
mas "1Password for Safari", id: 1569813296
mas "Affinity Photo", id: 824183456
mas "Day One", id: 1055511498
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WireGuard", id: 1451685025
