tap "containeroo/tap"
tap "fluxcd/tap"
tap "goreleaser/tap"
tap "nikitabobko/tap"
# General-purpose data compression with high compression ratio
brew "xz"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# GNU grep, egrep and fgrep
brew "grep"
# Kubernetes package manager
brew "helm"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Run local Kubernetes cluster in Docker
brew "kind"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Easily check your clusters for use of deprecated APIs
brew "kubent"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Automated testing for Ansible roles
brew "molecule"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Drop-in replacement for Terraform. Infrastructure as Code Tool
brew "opentofu"
# SDK for building Kubernetes applications
brew "operator-sdk"
# Fast, disk space efficient package manager
brew "pnpm"
# Password generator
brew "pwgen"
# Fast, efficient and secure backup program
brew "restic"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# User interface to the TELNET protocol
brew "telnet"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple CLI tool to generate OTP tokens
brew "containeroo/tap/otpgen"
# Flux CLI
brew "fluxcd/tap/flux"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# Application uninstaller
cask "appcleaner"
# Simple CLI tool to fetch GitLab CI variables and output them as exportable environment variables.
cask "ci-thief"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source media player
cask "iina"
# Clipboard manager
cask "maccy"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Team communication and collaboration software
cask "slack"
# Virtual machines UI using QEMU
cask "utm"
# Native desktop client for WhatsApp
cask "whatsapp"
# Gecko based web browser
cask "zen"
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "Mela", id: 1568924476
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "WireGuard", id: 1451685025
